{
    "splash": {
        "content": "Hello, I am apprentice web developer John Dulaney and welcome to my site! I say apprentice because I am currently enrolled in a full stack front end web development course at the Nashville Software School. This site is a representation of skills I have learned/am learning, as well as a project we are require to keep up with.",

        "contentTwo": "A short little bio: I was born November 22nd, 1988 in Knoxville Tennessee and have been living between East and middle TN my whole life, save the 5 years I attended a military academy in Missouri (Wentworth Military Academy). I graduated and Commissioned as an officer in the National Guard from there and soon attended the University of Missouri where a car accident ended my Army career and left me in a wheelchair. I have since returned to the Nashville area and attend NSS with high hopes on becoming a competent and successful web developer."
    },
    "myProjects": {
        "1": {
            "name": "Website",
            "url": "https://github.com/odn86/odn86.github.io",
            "description": "This website you are currently on is one of my starting projects at Nashville Software School. It will continue to grow as my knowledge of programming expands. I intend to keep this bad boy updated.",
            "dateCompleted": "Working on it",
            "techUsed": "HTML, JS, CSS",
            "teammates": "None"
        },
        "2": {
            "name": "Class Work",
            "url": "https://github.com/odn86/exercises",
            "description": "These are a few exercises assigned by NSS instructors to help use practice certain skills. Paired with the team oriented website building practice, I am developing a great working knowledge of the industry.",
            "dateCompleted": "Working on it",
            "techUsed": "HTML, JS, CSS",
            "teammates": "None"
        },
        "3": {
            "name": "Nutshell",
            "url": "nutshell.chasesteely.com",
            "description": "Nutshell is a psuedo social media single page app. It provided the user the ability to create tasks, add events, share news, and message other users(so long as they were on localhost.",
            "dateCompleted": "Work in progress. 1.0 launched 15NOV17",
            "techUsed": "HTML, JS, CSS, jQuery",
            "teammates": "Chase Steely, Max Wolf, and Paul Ellis"
        },

        "4": {
            "name": "Capstone",
            "url": "",
            "description": "We are 100% on the demands of this project yet, but we have seen our sister cohorts examples. Something along the lines of our own Application! Sounds fun.",
            "dateCompleted": "Have not begun",
            "techUsed": "Everything",
            "teammates": "None"
        }
    },

    "resume": {
        "1": {
            "title": "Produce Clerk",
            "company": "The Fresh Market",
            "dates": "2006",
            "responsibilities": "Chop fruit and keep the aisles lookoing good"
        },
        "2": {
            "title": "Private, Cadet, Platoon Leader",
            "company": "Missouri National Guard",
            "dates": "2007-2010",
            "responsibilities": "Ensure my platoon of 36 men were as lethal as possible and that all the needs of my commanders were met"
        },
        "3": {
            "title": "Stay at home son/student",
            "company": "Home llc",
            "dates": "2012- 2017",
            "responsibilities": "Keep the house clean and make life easy for elderly parents/recover from broken back/go to school"
        }
    },
    "contact": {
        "1": {
            "name": "Github",
            "username": "odn86",
            "url": "https://github.com/odn86/odn86.github.io",
            "icon": "../images/github.png"
        },
        "2": {
            "name": "Gmail",
            "username": "John",
            "url": "mailto:john.s.dulaney1@gmail.com",
            "icon": "../images/gmail.svg"
        }
    }
}